# RbsElecDistributionNodeSupplyFrom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecDistributionNodeSupplyFrom Property
ParameterTypeId Class See Also
---
"Supply From"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecDistributionNodeSupplyFrom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecDistributionNodeSupplyFrom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecDistributionNodeSupplyFrom {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace